{
  "backend/main.mo": "Motoko actor managing user profiles, lobbies, matches, player states, and game sessions with access control and authentication checks.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-style list of concise summaries for numerous frontend files describing UI, game logic, hooks, and scenes.",
  "frontend/index.css": "Tailwind base styles defining extensive CSS variables for light/dark themes and global styling rules.",
  "frontend/index.html": "HTML entry point setting page metadata and loading the main TypeScript module.",
  "frontend/ITCHIO_BUILD.md": "Documentation describing how to build for itch.io, including default and configurable output folder names.",
  "frontend/src/App.tsx": "Main application component handling view navigation and wrapping providers for theme, graphics, and debug settings.",
  "frontend/src/game/components/ImpactEffects.tsx": "Ref-based bullet impact visual effects with periodic cleanup and lightweight rendering.",
  "frontend/src/game/components/PlayerArmsAndWeapon.tsx": "First‑person weapon model with recoil, firing logic integration, and camera‑attached positioning.",
  "frontend/src/game/components/RemotePlayerAvatar.tsx": "Remote player avatar mesh with smooth interpolation and a WebGL label.",
  "frontend/src/game/components/RemotePlayerLabel.tsx": "Canvas‑rendered username label displayed as a Three.js sprite.",
  "frontend/src/game/controls/useFpsControls.ts": "Implements FPS camera movement with keyboard, mouse look, jumping, crouching, sprinting, and pointer lock using three.js and react-three-fiber.",
  "frontend/src/game/GameCanvas.tsx": "React Three Fiber canvas wrapper applying graphics settings such as DPR, antialiasing, and shadows.",
  "frontend/src/game/maps/DesertOutpostMap.tsx": "Renders a desert outpost scene with sandy terrain, trees, vegetation, buildings, a watchtower, and a fortified structure based on graphics settings.",
  "frontend/src/game/maps/HarborYardMap.tsx": "Builds a harbor yard environment with asphalt ground, perimeter trees, and numerous stacked shipping containers influenced by graphics settings.",
  "frontend/src/game/maps/JungleCompoundMap.tsx": "Creates a jungle compound featuring dense vegetation, muddy terrain, and multiple wooden elevated platforms adjusted by graphics mode.",
  "frontend/src/game/maps/mapRegistry.ts": "Registers available maps with names, descriptions, and components and provides lookup utilities.",
  "frontend/src/game/maps/props/Door.tsx": "Reusable door component rendering a frame, door slab, and handle with style-based colors and scaling.",
  "frontend/src/game/maps/props/GroundDetailGrass.tsx": "Generates randomized grass tuft meshes based on graphics mode, bounds, and density, rendering simple cross‑shaped grass groups.",
  "frontend/src/game/maps/props/LowPolyTree.tsx": "Renders a low‑poly tree with trunk and cone foliage, varying colors and sizes by variant and supporting shadows.",
  "frontend/src/game/maps/TrainingRangeMap.tsx": "Defines a training range with concrete terrain, perimeter trees, walls, cover boxes, and small sheds depending on graphics settings.",
  "frontend/src/game/scenes/OfflineSkirmishScene.tsx": "Implements an offline shooting scene with moving targets, hit detection via raycasting, and player FPS controls.",
  "frontend/src/game/scenes/OnlineMatchScene.tsx": "Renders an online match scene with FPS controls, remote players, position syncing, and a map selected from lobby data.",
  "frontend/src/game/scenes/TrainingScene.tsx": "Creates a static training area with walls, cover, targets, and basic firing impact logic using FPS controls.",
  "frontend/src/game/settings/DebugSettingsContext.tsx": "Context provider storing a toggle for showing a performance overlay, persisted to localStorage.",
  "frontend/src/game/settings/graphics.ts": "Defines graphics modes and returns rendering settings such as DPR, antialiasing, and shadow options.",
  "frontend/src/game/settings/GraphicsSettingsContext.tsx": "Context provider managing the current graphics mode with persistence in localStorage.",
  "frontend/src/game/settings/useDebugSettings.ts": "Hook exposing the debug settings context.",
  "frontend/src/game/settings/useGraphicsSettings.ts": "Hook exposing the graphics settings context.",
  "frontend/src/game/weapons/offlineWeapons.ts": "Defines simple offline weapon configs for rifle and SMG including fire rate, spread, and damage.",
  "frontend/src/game/weapons/useWeapon.ts": "Hook managing weapon firing rate and direction based on camera orientation, triggering onFire callbacks.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider to manage Internet Identity authentication, including loading, login, logout, and exposing identity state.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for user profiles, lobbies, players, and game actions like joining or starting a lobby.",
  "frontend/src/index.css": "Defines global Tailwind CSS styles, color variables, themes, and custom utility classes for gradients and HUD panels.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and the Internet Identity provider before rendering the main App component.",
  "frontend/src/pages/HomeView.tsx": "Renders the main menu with background, graphics settings, login, and navigation buttons for game modes.",
  "frontend/src/pages/LobbyView.tsx": "Displays active lobbies, allows joining, leaving, selecting maps, and starting games, with authentication and profile checks.",
  "frontend/src/pages/OfflineSkirmishView.tsx": "Runs the offline skirmish game scene, tracks player stats, handles weapon switching, and provides an ESC pause menu.",
  "frontend/src/pages/OnlineGameView.tsx": "Renders the online game view with a canvas, HUD, performance overlay, and an ESC menu with navigation and graphics options.",
  "frontend/src/pages/TrainingView.tsx": "Displays the training mode scene with HUD, optional performance overlay, and an ESC menu for navigation and settings.",
  "frontend/src/ui/DisclaimerFooter.tsx": "Shows a footer with project disclaimer text and a link attribution to caffeine.ai.",
  "frontend/src/ui/HudOverlay.tsx": "Provides an in-game HUD showing crosshair, stats, sync info, and mode-specific details for training, online, or offline play.",
  "frontend/src/ui/LoginButton.tsx": "Button component that handles Internet Identity login/logout with status feedback.",
  "frontend/src/ui/PerformanceOverlay.tsx": "Overlays FPS and graphics mode information, updating FPS periodically via requestAnimationFrame.",
  "frontend/src/ui/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to create a username profile and saving it via backend hooks.",
  "frontend/src/utils/assetPaths.ts": "Generates asset URLs that work in both dev and production with optional relative base paths.",
  "frontend/src/utils/errorMessages.ts": "Extracts and normalizes user-friendly error messages from various backend and agent error formats.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL and hash parameters, storing and retrieving them from sessionStorage, and syncing persisted values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, fonts, animations, and enabled plugins.",
  "frontend/vite.config.ts": "Vite config setting up React plugins, environment variables, path aliases, and build output options.",
  "project_state.json": "Tracks project metadata, requirements, constraints, and known issues for the game's development state."
}