{
  "backend/main.mo": "Motoko actor defining user profiles, lobbies, games, and player state with access control and functions for profile handling and lobby join/leave.",
  "feature_evidence.json": "Feature evidence report listing offline mode and gameplay feature requirements with associated files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend files including views, scenes, hooks, and UI components.",
  "frontend/index.css": "Root Tailwind CSS layer defining theme variables, dark mode overrides, and global base styles.",
  "frontend/index.html": "Base HTML document loading the React app entry point.",
  "frontend/src/App.tsx": "Main React component routing between home, training, lobby, online game, and offline skirmish views.",
  "frontend/src/game/components/ImpactEffects.tsx": "3D component rendering short‑lived bullet impact effects with lights and particles.",
  "frontend/src/game/components/PlayerArmsAndWeapon.tsx": "First‑person weapon viewmodel handling firing, recoil animation, and weapon configuration visuals.",
  "frontend/src/game/components/RemotePlayerAvatar.tsx": "Remote player avatar with smooth interpolation, capsule body, head, directional marker, and floating name label.",
  "frontend/src/game/controls/useFpsControls.ts": "Implements FPS movement and camera controls with keyboard, mouse look, jumping, crouching, and gravity updated each frame.",
  "frontend/src/game/GameCanvas.tsx": "Wrapper around React Three Fiber Canvas with performance-focused 3D rendering settings.",
  "frontend/src/game/scenes/OfflineSkirmishScene.tsx": "Renders an offline skirmish scene with moving targets, FPS controls, weapon firing with spread, and hit detection via raycasting.",
  "frontend/src/game/scenes/OnlineMatchScene.tsx": "Displays an online match environment, syncing local player position to the server and rendering remote players alongside FPS controls and impact effects.",
  "frontend/src/game/scenes/TrainingScene.tsx": "Provides a static training area with walls, cover, target dummies, and basic firing impact handling using FPS controls.",
  "frontend/src/game/weapons/offlineWeapons.ts": "Defines basic weapon configurations for offline play including fire rate, spread, and damage.",
  "frontend/src/game/weapons/useWeapon.ts": "Hook managing weapon firing rate and computing shot direction from the camera before triggering the onFire callback.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the user's identity, refreshing dependent queries when the actor updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity login, stored identities, and authentication state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile, player state, lobby management, and game actions using an actor API.",
  "frontend/src/index.css": "Configures Tailwind base styles, theme variables for light/dark modes, and custom utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/HomeView.tsx": "Renders the home menu with game mode buttons, authentication UI, and themed background.",
  "frontend/src/pages/LobbyView.tsx": "Provides multiplayer lobby UI with lobby listing, creation, joining, leaving, and game start functions.",
  "frontend/src/pages/OfflineSkirmishView.tsx": "Runs the offline skirmish mode with game canvas, hit/miss tracking, weapon switching, and a pause menu.",
  "frontend/src/pages/OnlineGameView.tsx": "Displays the online match scene with HUD and an ESC-based pause menu.",
  "frontend/src/pages/TrainingView.tsx": "Runs the training mode scene with HUD and a pause menu for returning or resuming.",
  "frontend/src/ui/DisclaimerFooter.tsx": "Renders a footer with an original-project disclaimer and a dynamic link to caffeine.ai.",
  "frontend/src/ui/HudOverlay.tsx": "Displays an in-game HUD showing crosshair, stats, and mode-specific info for online or offline play.",
  "frontend/src/ui/LoginButton.tsx": "Provides a sign-in/out button using Internet Identity with loading and error handling.",
  "frontend/src/ui/ProfileSetupDialog.tsx": "Shows a dialog prompting new authenticated users to create a profile and save a callsign.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters and persisting them in sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Project state file describing versioning, goals, constraints, and implemented features."
}