{
  "backend/main.mo": "Actor implementing user profiles, lobby management, player state, and game/match tracking with access control checks.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing their purpose in the app.",
  "frontend/index.css": "Defines Tailwind base layers and light/dark theme color variables with OKLCH values.",
  "frontend/index.html": "HTML entry point mounting the root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Main React app component handling theme, navigation state, and view routing.",
  "frontend/src/game/components/ImpactEffects.tsx": "Renders short‑lived bullet impact lights and spheres, exposing an addImpact method via ref.",
  "frontend/src/game/components/PlayerArmsAndWeapon.tsx": "First‑person weapon model with recoil, muzzle flash, and firing logic tied to useWeapon.",
  "frontend/src/game/components/RemotePlayerAvatar.tsx": "Displays remote player avatars with interpolated movement, rotation, and a floating name label.",
  "frontend/src/game/controls/useFpsControls.ts": "Implements FPS camera controls with keyboard, mouse‑look, movement, gravity, jumping, crouching, and pointer lock handling.",
  "frontend/src/game/GameCanvas.tsx": "Wrapper for a React Three Fiber Canvas with configured camera, fog, and rendering settings.",
  "frontend/src/game/scenes/OfflineSkirmishScene.tsx": "Renders an offline target‑practice scene with moving targets, FPS movement, weapon firing with spread, and hit detection via raycasting.",
  "frontend/src/game/scenes/OnlineMatchScene.tsx": "Renders an online match scene using FPS controls, syncing player position to the server and displaying remote player avatars.",
  "frontend/src/game/scenes/TrainingScene.tsx": "Provides a static training map with FPS controls, target dummies, and simple impact effects when firing.",
  "frontend/src/game/weapons/offlineWeapons.ts": "Defines basic weapon configs for offline mode including fire rate, spread, and damage.",
  "frontend/src/game/weapons/useWeapon.ts": "Hook managing weapon firing logic, enforcing fire rate and computing shot direction from the camera.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context and login management using AuthClient, exposing identity state and actions.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profiles, lobbies, players, and game actions via the backend actor with caching and mutations.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom CSS variables for themes plus utility styles like gradients and HUD panel.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/HomeView.tsx": "Renders the main menu with background, login, and navigation buttons for training, offline, and online modes.",
  "frontend/src/pages/LobbyView.tsx": "Displays active lobbies, allows creating/joining/leaving lobbies, starting games, and handles authentication and profile checks.",
  "frontend/src/pages/OfflineSkirmishView.tsx": "Runs the offline skirmish scene with stats tracking, weapon switching, and an ESC pause menu.",
  "frontend/src/pages/OnlineGameView.tsx": "Hosts the online match scene with HUD and an ESC pause menu for returning to the lobby.",
  "frontend/src/pages/TrainingView.tsx": "Runs the training scene with HUD and an ESC-accessible pause menu with controls info.",
  "frontend/src/ui/DisclaimerFooter.tsx": "Renders a footer with a legal disclaimer and a referral link using the current hostname as a tracking parameter.",
  "frontend/src/ui/HudOverlay.tsx": "Displays an in-game HUD showing crosshair, stats, and mode-specific info such as online sync, offline stats, or training labels.",
  "frontend/src/ui/LoginButton.tsx": "Provides a sign‑in/sign‑out button using Internet Identity with loading and error‑handling logic.",
  "frontend/src/ui/ProfileSetupDialog.tsx": "Shows a dialog prompting new authenticated users to create a profile and saves the chosen username.",
  "frontend/src/utils/errorMessages.ts": "Converts various error types into user‑friendly messages while preserving detailed errors for logging.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugin integrations for the app's UI theme.",
  "project_state.json": "Project metadata describing features, requirements, issues, and the current state of the game's development."
}