{
  "backend/main.mo": "Motoko actor managing user profiles, lobbies, matches, and game state with access control and authenticated operations.",
  "feature_evidence.json": "Feature evidence report linking a UI error-handling improvement to specific frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of various frontend files including pages, hooks, UI, and game systems.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens, dark mode variables, and global background/foreground styling.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx with a static title and root mount point.",
  "frontend/src/App.tsx": "Top-level React component handling view routing and wrapping the app with theme, graphics, and debug providers.",
  "frontend/src/game/components/ImpactEffects.tsx": "Manages transient bullet impact visual effects with ref-based storage and periodic cleanup.",
  "frontend/src/game/components/PlayerArmsAndWeapon.tsx": "First-person weapon model with recoil logic, firing handling, and camera-relative positioning.",
  "frontend/src/game/components/RemotePlayerAvatar.tsx": "Interpolated remote player model using smoothed position/rotation updates and in-world labels.",
  "frontend/src/game/components/RemotePlayerLabel.tsx": "Creates a WebGL sprite label for player names using a dynamically generated canvas texture.",
  "frontend/src/game/controls/useFpsControls.ts": "Custom FPS camera hook handling keyboard movement, mouse look, pointer lock, sprinting, crouching, and jumping with physics-like velocity updates.",
  "frontend/src/game/GameCanvas.tsx": "Canvas wrapper configuring WebGL settings based on selected graphics mode and applying background and fog.",
  "frontend/src/game/maps/DesertOutpostMap.tsx": "Renders a desert outpost scene with sandy terrain, perimeter trees, ground detail, a central building, watchtower, and props based on graphics settings.",
  "frontend/src/game/maps/HarborYardMap.tsx": "Builds a harbor yard environment with asphalt ground, trees, weeds, and various stacked shipping containers influenced by graphics mode.",
  "frontend/src/game/maps/JungleCompoundMap.tsx": "Creates a jungle compound featuring muddy terrain, dense vegetation, and multiple elevated wooden platforms with support posts.",
  "frontend/src/game/maps/mapRegistry.ts": "Maps game IDs to map components with display metadata and provides helpers to fetch individual or all map definitions.",
  "frontend/src/game/maps/props/Door.tsx": "Reusable door component rendering a frame, door slab, and handle with styles for metal, wood, or reinforced variants.",
  "frontend/src/game/maps/props/GroundDetailGrass.tsx": "Generates randomized grass tuft meshes based on graphics mode and density within given bounds.",
  "frontend/src/game/maps/props/LowPolyTree.tsx": "Renders a low‑poly tree with trunk and cone foliage, varying colors and sizes by variant.",
  "frontend/src/game/maps/TrainingRangeMap.tsx": "Defines a training range map with flat terrain, trees, walls, cover boxes, and small sheds, adapting detail to graphics mode.",
  "frontend/src/game/scenes/OfflineSkirmishScene.tsx": "Implements an offline shooting range with moving targets, hit detection, and weapon spread.",
  "frontend/src/game/scenes/OnlineMatchScene.tsx": "Renders an online match scene with map selection, remote player avatars, and throttled position updates.",
  "frontend/src/game/scenes/TrainingScene.tsx": "Provides a simple training area with walls, boxes, targets, and basic impact handling.",
  "frontend/src/game/settings/DebugSettingsContext.tsx": "Stores debug settings and persists the performance overlay toggle in localStorage.",
  "frontend/src/game/settings/graphics.ts": "Defines graphics modes and returns per‑mode rendering settings such as DPR and shadows.",
  "frontend/src/game/settings/GraphicsSettingsContext.tsx": "Manages and persists the selected graphics mode using React context.",
  "frontend/src/game/settings/useDebugSettings.ts": "Convenience hook for accessing debug settings context.",
  "frontend/src/game/settings/useGraphicsSettings.ts": "Convenience hook for accessing graphics settings context.",
  "frontend/src/game/weapons/offlineWeapons.ts": "Defines offline weapon configs including fire rate, spread, and damage for rifle and SMG.",
  "frontend/src/game/weapons/useWeapon.ts": "Hook providing firing logic with rate limiting and direction based on camera quaternion.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and provider for Internet Identity authentication, handling identity loading, login, and logout states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actors, including user profile, lobbies, player state, and game actions.",
  "frontend/src/index.css": "Tailwind CSS configuration with theme variables, light/dark mode styles, and custom utility classes.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the application.",
  "frontend/src/pages/HomeView.tsx": "Home screen UI with authentication, navigation, game mode selection, and graphics settings controls.",
  "frontend/src/pages/LobbyView.tsx": "Lobby management UI for listing, joining, creating, leaving lobbies, selecting maps, and starting games.",
  "frontend/src/pages/OfflineSkirmishView.tsx": "Offline skirmish gameplay view with canvas rendering, HUD, weapon switching, stats tracking, and pause menu.",
  "frontend/src/pages/OnlineGameView.tsx": "Renders the online game view with canvas, HUD, performance overlay, and an ESC pause menu with graphics and debug settings.",
  "frontend/src/pages/TrainingView.tsx": "Displays the training mode with a game canvas, HUD, optional performance overlay, and a pause menu similar to the online view.",
  "frontend/src/ui/DisclaimerFooter.tsx": "Shows a footer with project disclaimers and a link attribution to caffeine.ai.",
  "frontend/src/ui/HudOverlay.tsx": "Provides an in-game HUD showing crosshair, stats, sync info, and mode-specific details for training, online, or offline play.",
  "frontend/src/ui/LoginButton.tsx": "Button component handling Internet Identity login/logout with loading and error recovery states.",
  "frontend/src/ui/PerformanceOverlay.tsx": "Displays real-time FPS and graphics mode using a lightweight animation loop.",
  "frontend/src/ui/ProfileSetupDialog.tsx": "Prompts authenticated users without a profile to create a username and saves it through backend hooks.",
  "frontend/src/utils/errorMessages.ts": "Utility for extracting and normalizing user‑friendly error messages from various backend and agent error formats.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read URL parameters, persist them in sessionStorage, and clear them, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, typography, animations, and plugin setup.",
  "project_state.json": "JSON describing the game project's state, requirements, constraints, and known issues, including versioning and feature definitions."
}