{
  "kind": "build_request",
  "title": "Fix lobby creation failure (Create New Lobby shows 'Failed')",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Fix backend authorization so an authenticated Internet Identity user can successfully create a lobby via joinLobby (and does not hit an 'Unauthorized' trap due to missing #user permission). Ensure the anonymous principal is still blocked from creating lobbies.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "i can't create a new lobby it say failed"
        ]
      },
      "acceptanceCriteria": [
        "Calling joinLobby as an authenticated principal succeeds and returns a LobbyState.",
        "Calling joinLobby as the anonymous principal traps with a clear unauthorized error.",
        "The change does not require a state migration (no migration.mo added unless strictly necessary)."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Fix backend authorization so an authenticated Internet Identity user can save a user profile via saveCallerUserProfile without requiring pre-existing #user permissions (avoid a permissions deadlock for first-time users). Anonymous principal must still be blocked.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "i can't create a new lobby it say failed"
        ]
      },
      "acceptanceCriteria": [
        "Authenticated users can call saveCallerUserProfile successfully even on first login.",
        "Anonymous principal cannot call saveCallerUserProfile.",
        "Existing user profiles continue to load correctly via getCallerUserProfile for authenticated users."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Improve the Lobby UI error handling for lobby creation failures by displaying a more specific, user-readable error message (e.g., include backend error text when available) instead of only the generic toast 'Failed to create lobby'.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "i can't create a new lobby it say failed"
        ]
      },
      "acceptanceCriteria": [
        "When Create New Lobby fails, the toast includes a specific reason when available (e.g., unauthorized/anonymous/other trap message), while still being in English and user-friendly.",
        "Console logging remains available for debugging, but the user-facing toast is more informative than the current generic message."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Prevent unauthenticated users from attempting to create a lobby from the Lobby screen: disable or gate the 'Create New Lobby' action when Internet Identity is not connected, and show an English prompt to sign in.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "i can't create a new lobby it say failed"
        ]
      },
      "acceptanceCriteria": [
        "If the user is not signed in, clicking Create New Lobby does not call the joinLobby mutation.",
        "The UI clearly indicates sign-in is required to create a lobby (English text).",
        "If the user signs in, the Create New Lobby action becomes available without needing a page reload."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui."
  ],
  "nonGoals": [
    "Adding new multiplayer gameplay features beyond fixing lobby creation and related authorization.",
    "Implementing real-time networking (WebSockets) or external databases/auth providers."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}