{
  "kind": "build_request",
  "title": "Make the Vite build output folder name configurable (change default dist)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-33",
      "text": "Allow changing the production build output folder name (currently \"dist\") by making Vite's build.outDir configurable, while keeping \"dist\" as the default when no override is provided.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "can i change my build folder name"
        ]
      },
      "acceptanceCriteria": [
        "By default, running the production build still outputs to a folder named \"dist\".",
        "There is a documented, supported way to override the output folder name (e.g., via an environment variable) without editing source files each time.",
        "The configured output folder is used consistently for the Vite build output."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Update the itch.io build documentation to reflect that the build folder name may be configured, and clearly state how to identify which folder to zip for upload (using English user-facing text).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "User: dist",
          "User: can i change my build folder name"
        ]
      },
      "acceptanceCriteria": [
        "Documentation explains the default build folder name is \"dist\".",
        "Documentation explains how to change the build folder name (matching the implementation in REQ-33).",
        "Documentation instructs users to zip the configured build output folder (the one containing index.html) for itch.io upload."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui (compose instead).",
    "Keep the existing relative base path behavior (base: \"./\") so the output remains itch.io compatible."
  ],
  "nonGoals": [
    "Changing the app’s runtime routing/base URL behavior beyond what is required for a renamed output folder.",
    "Adding new deployment targets or external hosting integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}