{
  "kind": "build_request",
  "title": "Fix Multiplayer Lobby Creation Failure for Authenticated Users",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-28",
      "text": "Fix backend authorization so an authenticated Internet Identity user can successfully create a new lobby via the joinLobby method, while the anonymous principal remains blocked.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-4",
          "recent-messages-7"
        ],
        "quotes": [
          "MULTIPLAYER LOBBY not let me create new lobby",
          "try again"
        ]
      },
      "acceptanceCriteria": [
        "When signed in with Internet Identity, calling joinLobby returns a LobbyState and persists the lobby so it appears in getActiveLobbies.",
        "When not signed in (anonymous caller), calling joinLobby traps with an Unauthorized error.",
        "Creating a lobby does not require any pre-existing permissions that a first-time user would not have."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Remove or revise backend permission checks that currently rely on #user permissions in a way that can deadlock normal gameplay (e.g., leaveLobby, updatePlayerPosition, getPlayersInGame, startGame, endGame), so that authenticated users can perform expected multiplayer actions without needing manual permission assignment, while anonymous callers remain blocked.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "MULTIPLAYER LOBBY not let me create new lobby"
        ]
      },
      "acceptanceCriteria": [
        "Authenticated users can leave a lobby they are in using leaveLobby without hitting an Unauthorized error caused solely by missing #user permission.",
        "Authenticated users can updatePlayerPosition and fetch getPlayersInGame without hitting an Unauthorized error caused solely by missing #user permission.",
        "Authenticated lobby host can startGame without hitting an Unauthorized error caused solely by missing #user permission.",
        "Anonymous callers are still rejected (Unauthorized) for multiplayer state-changing actions."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Ensure the Lobby UI surfaces the real backend error reason when lobby creation fails (instead of a generic message like \"failed\"), using English user-facing text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "MULTIPLAYER LOBBY not let me create new lobby"
        ]
      },
      "acceptanceCriteria": [
        "If lobby creation fails due to backend trap/Unauthorized/not found, the toast shows a specific, English message that reflects the underlying reason (not only \"failed\" or \"An unexpected error occurred\").",
        "Console logging still includes the raw error object for debugging.",
        "The existing authentication gating behavior remains intact (unauthenticated users cannot attempt to create a lobby)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Adding new multiplayer features (chat, voice, matchmaking, or WebSockets).",
    "Changing map content, weapons, or graphics/performance settings.",
    "Introducing any external database or third-party auth besides Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}