{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Configurable Vite production build output folder (default: dist) + updated itch.io docs",
  "requirements": [
    {
      "id": "REQ-33",
      "summary": "Make Vite build.outDir configurable (defaulting to \"dist\") while preserving base: \"./\" for itch.io compatibility.",
      "acceptanceCriteria": [
        "By default, running the production build still outputs to a folder named \"dist\".",
        "There is a documented, supported way to override the output folder name (e.g., via an environment variable) without editing source files each time.",
        "The configured output folder is used consistently for the Vite build output."
      ],
      "file_operations": [
        {
          "path": "frontend/vite.config.ts",
          "operation": "modify",
          "description": "Update Vite config to derive build.outDir from a supported override (e.g., a Node environment variable such as BUILD_OUT_DIR), falling back to \"dist\" when not provided. Keep base set to \"./\" unchanged to preserve existing relative base path behavior and itch.io compatibility."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Update itch.io build documentation to explain the default and configurable build output folder, and which folder to zip for upload.",
      "acceptanceCriteria": [
        "Documentation explains the default build folder name is \"dist\".",
        "Documentation explains how to change the build folder name (matching the implementation in REQ-33).",
        "Documentation instructs users to zip the configured build output folder (the one containing index.html) for itch.io upload."
      ],
      "file_operations": [
        {
          "path": "frontend/ITCHIO_BUILD.md",
          "operation": "modify",
          "description": "Expand the itch.io build guide with clear English instructions: confirm default output folder is \"dist\"; document how to override the build output folder name (matching the environment-variable-based approach implemented in frontend/vite.config.ts); and instruct users to zip the configured output folder (the one that contains index.html) for upload to itch.io."
        }
      ]
    }
  ]
}