{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Surface Real Backend Errors in Multiplayer Lobby Creation UI",
  "requirements": [
    {
      "id": "REQ-30",
      "summary": "Show specific, English lobby-creation failure reasons from backend traps/rejections (instead of generic failure), while keeping raw error logging and existing auth gating.",
      "acceptanceCriteria": [
        "If lobby creation fails due to backend trap/Unauthorized/not found, the toast shows a specific, English message that reflects the underlying reason (not only \"failed\" or \"An unexpected error occurred\").",
        "Console logging still includes the raw error object for debugging.",
        "The existing authentication gating behavior remains intact (unauthenticated users cannot attempt to create a lobby)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/errorMessages.ts",
          "operation": "modify",
          "description": "Improve error extraction to reliably surface the underlying backend rejection/trap reason (e.g., Unauthorized vs not found vs transient/network), including handling common agent error shapes (message/reject_message/error_code) and returning clear English user-facing text. Align behavior with the selected \"authorization\" component’s guidance on handling authorization errors from backend trap calls. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/LobbyView.tsx",
          "operation": "modify",
          "description": "Update lobby creation failure handling to present a specific, contextual toast message derived from the enhanced extractErrorMessage (e.g., prefix with \"Could not create lobby:\" when appropriate), while keeping console.error logging of the raw error object and preserving the existing authentication/profile gating that prevents unauthenticated users from attempting lobby creation. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}